# Александр я удаял файлы которые были в замечаниях, но проект
# перестал запускаться. Виртуальное окружение перестало создаваться
# через термил bash (в задании сказано, что использовать нужно терминал
# bash). долго мучался пытался понять в чем проблемма в итоге так и не
# нашел причину.

# виртуальное окружение создавал через (powershell) сервер тоже через него
# запускал. Знаю, что так нельзя по заданию но я просто здаюсь, я не знаю
# как починить виртуальное окруженние, gpt пишет что vs code сылается не на
# phyton а что, вместо него установленна заглушка. И много другух возможных
# проблемм.(Типо нет прав на создания)
# Думаю может все удалить и установить заново (phyton, vs code)
